//Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// Console.Write("Введите первое число: ");
// int a = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите второе число: ");
// int b = Convert.ToInt32(Console.ReadLine());

// int max = a;

// if (a > max) max = a;
// if (b > max) max = b;

// Console.Write("max = "); 
// Console.WriteLine(max); 

//Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

// Console.Write("Введите первое число: ");
// int a = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите второе число: ");
// int b = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите третье число: ");
// int c = Convert.ToInt32(Console.ReadLine());


// int max = a;

// if (a > max) max = a;
// if (b > max) max = b;
// if (c > max) max = c;

// Console.Write("max = "); 
// Console.WriteLine(max); 

// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// Console.Write("Введите число: ");
// int a = Convert.ToInt32(Console.ReadLine());

// if (a % 2 == 0)
// {
//     Console.WriteLine("Да");
// }
// else
// {
//     Console.WriteLine("Нет");
// }

// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// System.Console.WriteLine("Введите число:");
// int N = int.Parse(Console.ReadLine());
// int i = 1;
// if (N <= 1)
// {
//     System.Console.WriteLine("Введите число, которое будет больше чем 1: ");
// }
// else
// {
//     System.Console.WriteLine("Все четные числа от 1 до " + N);
//     while (i <= N)
//     {
//         System.Console.WriteLine(i += 1);
//         i++;
//     }
// }
